PICdew/PIC24FJ64GB002_sd_bootloader/PIC24_sd_bootloader.X/boot.c
/*
 * File:   boot.c
 * Author: NAOYA
 *
 * Created on 2017/04/09, 22:43
 */


//Includes *******************************
#include <stdio.h>
#include "delay.h"
#include "sd_card.h"
#include "system.h"
#include "fileio.h"
#include "pic_hex_mapper.h"

#ifdef __XC16
#include <xc.h>
#include "config.h"
#include "uart.h"
#endif

#define HEX_FILE_NAME "TEST.hex"
#define BUF             (100)

//****************************************


//Globals ********************************
WORD responseBytes;		//number of bytes in command response
DWORD_VAL sourceAddr;	//general purpose address variable
DWORD_VAL userReset;	//user code reset vector
DWORD_VAL userTimeout; 	//bootloader entry timeout value
WORD userResetRead;		//bool - for relocating user reset vector

//Variables for storing runaway code protection keys
#ifdef USE_RUNAWAY_PROTECT
volatile WORD writeKey1 = 0xFFFF;
volatile WORD writeKey2 = 0x5555;
volatile WORD keyTest1 = 0x0000;
volatile WORD keyTest2 = 0xAAAA;
#endif

//Transmit/Recieve Buffer
BYTE buffer[MAX_PACKET_SIZE+1];
//****************************************

#define DEV_HAS_USB

#ifndef DEV_HAS_CONFIG_BITS
    #ifdef DEV_HAS_USB
    _CONFIG1( JTAGEN_OFF & GCP_OFF & GWRP_OFF & ICS_PGx1 & FWDTEN_OFF )
    _CONFIG2( IESO_ON & FNOSC_FRCPLL & FCKSM_CSDCMD & OSCIOFNC_ON &
	IOL1WAY_OFF & I2C1SEL_PRI & POSCMOD_NONE  & PLL96MHZ_ON & PLLDIV_DIV2 )
	_CONFIG4(RTCOSC_SOSC)
    #else
    _CONFIG1(JTAGEN_OFF & GWRP_OFF & ICS_PGx2 & FWDTEN_OFF)
    _CONFIG2(POSCMOD_HS & FNOSC_PRIPLL)
    #endif
#else
    _FOSCSEL(FNOSC_PRIPLL)
    _FOSC(POSCFREQ_MS & POSCMOD_XT)
    _FWDT(FWDTEN_OFF)
    _FICD(ICS_PGx3)
#endif
//****************************************


/********************************************************************
* Function: 	int main()
*
* Precondition: None.
*
* Input: 		None.
*
* Output:		None.
*
* Side Effects:	Enables 32-bit Timer2/3.  Enables UART.
*
* Overview: 	Initialization of program and main loop.
*			
* Note:		 	None.
********************************************************************/
    
       
        
void init_uart(void){
    RPINR18bits.U1RXR = 2;  //rx UART1 RP2
	RPOR1bits.RP3R = 3;     //tx UART1
	CloseUART1();

	unsigned int config1 =  UART_EN &               // UART enable
							UART_IDLE_CON &         // operete in Idle mode
							UART_DIS_WAKE &         // Don't wake up in sleep mode
							UART_IrDA_DISABLE &
							UART_DIS_LOOPBACK &     // don't loop back
							UART_NO_PAR_8BIT &      // No parity bit, 8bit
							UART_1STOPBIT &         //Stop bit
							UART_MODE_SIMPLEX  &    //no flow control
							UART_UEN_00 &
							UART_UXRX_IDLE_ONE &    // U1RX idle 1
							UART_BRGH_SIXTEEN &     // invalid high speed transport
							UART_DIS_ABAUD;         // disable audo baud

	unsigned int config2 =  UART_INT_TX_BUF_EMPTY &  // TXD interrupt on
							UART_IrDA_POL_INV_ZERO & // U1TX idle clear
							UART_TX_ENABLE &         // Enable TXD
							UART_INT_RX_CHAR &       // RXD interrupt on
							UART_ADR_DETECT_DIS &
							UART_RX_OVERRUN_CLEAR;


	OpenUART1(config1, config2,8 );
	ConfigIntUART1( UART_RX_INT_EN & UART_TX_INT_DIS );
	IEC0bits.U1RXIE = 0; //disable interrupt
}

    
int is_boot_mode(void){
    //TODO: Implement decision logic here.
    
    return 1;
}
   

/**
 * process_each_line
 * @param 
 * @param processor
 * @return 
 */
int process_each_line(FILEIO_OBJECT file, void (processor)(char* )){
    int ret;
    char str[BUF] ="";
    int i=0;
    
    while(1){
        ret = FILEIO_GetChar(&file);    //read char from file.
        str[i]=ret;
        i++;
        if(ret == EOF){break;}
        if(ret=='\r'||ret=='\n'){   //Detect CR or LF.
			if(i!=0){
            	str[i]='\0';

                //Process strings
                processor(str);
			
            	//Reset str
            	str[0]='\0';
            	i=0;
			}
        }else{
			str[i]=ret;
			i++;
		}
    }
    return 0;
}

/**
 * 
 * @param str
 */
void parse_hex_and_map(char *str){
    FORMAT fmt;
    if(-1==parse_hex_format(str,&fmt)){
        printf("ERROR!!!!\r\n");
    }
    map_hex_format(&fmt);
}

/**
 * 
 * @param str
 */
void print(char *str){
    printf("%s\r\n",str);
}

/**
 * 
 * @param str
 */
void verify(char *str){
    FORMAT fmt;
    if(-1==parse_hex_format(str,&fmt)){
        printf("ERROR!!!!\r\n");
    }
    //TODO : Implement verify function.
}


/**
 * main
 * @return 
 */
int main(void){
    
    CLKDIV = 0;
    SYSTEM_Initialize();
    
    //Setup user reset vector
	sourceAddr.Val = USER_PROG_RESET;
	userReset.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);
    

    //It is not boot mode. goto user app.
    if(0==is_boot_mode()){   
        //GOTO user application.
        ResetDevice(userReset.Val); 
    }
     
    //It is boot_mode.
    //Read hex file and write to program memory.
    sd_initialize();
        
        	
    //File IO
    FILEIO_OBJECT file;
        
    //open file
    if (FILEIO_Open (&file,  HEX_FILE_NAME , FILEIO_OPEN_READ | FILEIO_OPEN_APPEND | FILEIO_OPEN_CREATE) == FILEIO_RESULT_FAILURE)
    {
        return -1;
    }
    
    process_each_line(file, parse_hex_and_map);

    // Close the file to save the data
    if (FILEIO_Close (&file) != FILEIO_RESULT_SUCCESS){ return -1; }
        
    sd_finalize();
    
    //GOTO user application.
    ResetDevice(userReset.Val); 

    return 0;
}


    
//#define DEBUG
    /*
int main()
{
    CLKDIV = 0;
    SYSTEM_Initialize();
    //init_uart();
    
#ifdef DEBUG
    delay_ms(3);
    printf("hello");
    printf("\r\n\r\n\r\n");
#endif

    //////////////////////////////////
        
	DWORD_VAL delay;

	//Setup bootloader entry delay
	sourceAddr.Val = DELAY_TIME_ADDR;	//bootloader timer address
	delay.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW); //read BL timeout
	
	//Setup user reset vector
	sourceAddr.Val = USER_PROG_RESET;
	userReset.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);

	//Prevent bootloader lockout - if no user reset vector, reset to BL start
	if(userReset.Val == 0xFFFFFF){
		userReset.Val = BOOT_ADDR_LOW;	
	}
	userResetRead = 0;
    
#ifdef DEBUG
    printf("delay_val: %ld \r\nuser_reset: %ld \r\n",delay.Val,userReset.Val);
#endif 
    

	//If timeout is zero, check reset state.
	if(delay.v[0] == 0){

		//If device is returning from reset, BL is disabled call user code
		//otherwise assume the BL was called from use code and enter BL
		if(RCON & 0xFED3){
			//If bootloader disabled, go to user code
			ResetDevice(userReset.Val);         //
		}else{
			delay.Val = 0xFF;
		}
	}


	T2CONbits.TON = 0;
	T2CONbits.T32 = 1; // Setup Timer 2/3 as 32 bit timer incrementing every clock
	IFS0bits.T3IF = 0; // Clear the Timer3 Interrupt Flag 
	IEC0bits.T3IE = 0; // Disable Timer3 Interrupt Service Routine 

	//Enable timer if not in always-BL mode
	if((delay.Val & 0x000000FF) != 0xFF){
		//Convert seconds into timer count value 
		delay.Val = ((DWORD)(FCY)) * ((DWORD)(delay.v[0])); 

		PR3 = delay.word.HW; //setup timer timeout value
		PR2 = delay.word.LW;

		TMR2 = 0;
		TMR3 = 0;
		T2CONbits.TON=1;  //enable timer
	}


